coin-storage-system-api/src/main/resources/examples/updateCoinInput.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tra="http://training.mulesoft.com/">
   <soapenv:Header>
      <tra:updateCoinHeader>
         <documentID>?</documentID>
      </tra:updateCoinHeader>
   </soapenv:Header>
   <soapenv:Body>
      <tra:updateCoin>
         <!--Optional:-->
         <oldDate>?</oldDate>
         <!--Optional:-->
         <newDate>?</newDate>
         <!--Optional:-->
         <dateDifference>?</dateDifference>
         <!--Optional:-->
         <date>?</date>
         <data>
            <!--Zero or more repetitions:-->
            <coin>
               <name>?</name>
               <symbol>?</symbol>
               <supply>?</supply>
               <developmentStatus>?</developmentStatus>
               <proofType>?</proofType>
               <orgStructure>?</orgStructure>
               <!--Optional:-->
               <coin_market_price>?</coin_market_price>
               <!--Optional:-->
               <coin_cap_price>?</coin_cap_price>
               <!--Optional:-->
               <coin_market_oldPriceUsd>?</coin_market_oldPriceUsd>
               <!--Optional:-->
               <coin_cap_oldPriceUsd>?</coin_cap_oldPriceUsd>
               <!--Optional:-->
               <coin_market_newPriceUsd>?</coin_market_newPriceUsd>
               <!--Optional:-->
               <coin_cap_newPriceUsd>?</coin_cap_newPriceUsd>
               <!--Optional:-->
               <coin_market_priceDifference>?</coin_market_priceDifference>
               <!--Optional:-->
               <coin_cap_priceDifference>?</coin_cap_priceDifference>
               <coin_market_volume24h>?</coin_market_volume24h>
               <coin_cap_volume24h>?</coin_cap_volume24h>
            </coin>
         </data>
      </tra:updateCoin>
   </soapenv:Body>
</soapenv:Envelope>